In [85]:
#Import Dependencies
import pandas as pd
from pathlib import Path

In [86]:
# Store filepaths into variables
total_asset_loan_value_csv = Path("Resources/Total Loan Assets.csv")
average_rate_of_financed_loan_csv = Path("Resources/Average Loan Finance.csv")
average_amount_financed_csv= Path("Resources/Average Amount Financed.csv")

In [89]:
# Read the CSV files
total_asset_loan_value_df = pd.read_csv(total_asset_loan_value_csv)
average_rate_of_financed_loan_df = pd.read_csv(average_rate_of_financed_loan_csv)
average_amount_financed_df = pd.read_csv(average_amount_financed_csv)

In [ ]:
#Dispay the data
total_asset_loan_value_df.head()

         DATE  QBPBSTASLNINDVOLNINDCARLN
0  2014-07-01                 379531.304
1  2014-10-01                 385156.262
2  2015-01-01                 389633.848
3  2015-04-01                 397633.220
4  2015-07-01                 407873.676

In [ ]:
#Rename Columns & Change to Float
total_asset_loan_value_df = total_asset_loan_value_df.rename(columns={"QBPBSTASLNINDVOLNINDCARLN": "Total Loan Amount"})
total_asset_loan_value_df.head()

         DATE  Total Loan Amount
0  2014-07-01         379531.304
1  2014-10-01         385156.262
2  2015-01-01         389633.848
3  2015-04-01         397633.220
4  2015-07-01         407873.676

In [ ]:
average_rate_of_financed_loan_df.head()

         DATE         RIELPCFANNM
0  2014-07-01  4.6800000000000000
1  2014-10-01  4.8200000000000000
2  2015-01-01  5.1900000000000000
3  2015-04-01  5.3800000000000000
4  2015-07-01  4.9200000000000000

In [92]:
#Rename Columns
average_rate_of_financed_loan_df = average_rate_of_financed_loan_df.rename(columns={"RIELPCFANNM": "Average Loan Rate"})
average_rate_of_financed_loan_df['Average Loan Rate'] = pd.to_numeric(average_rate_of_financed_loan_df['Average Loan Rate'], errors='coerce').fillna(0.0)
average_rate_of_financed_loan_df.dtypes

DATE                  object
Average Loan Rate    float64
dtype: object

In [ ]:
average_amount_financed_df.head()

         DATE         DTCTLVENANM
0  2014-07-01  26370.630000000000
1  2014-10-01  26755.300000000000
2  2015-01-01  27272.360000000000
3  2015-04-01  26932.270000000000
4  2015-07-01  27697.600000000000

In [93]:
average_amount_financed_df=average_amount_financed_csv_df.rename(columns={"DTCTLVENANM": "Average Financed Amount"})
average_amount_financed_df['Average Financed Amount'] = pd.to_numeric(average_amount_financed_df['Average Financed Amount'], errors='coerce').fillna(0.0)
average_amount_financed_df.dtypes

DATE                        object
Average Financed Amount    float64
dtype: object

In [94]:
#Merge the dataframes
revenue_rate_df = pd.merge(total_asset_loan_value_df, average_amount_of_financed_loan_df, on="DATE")
revenue_rate_df.dtypes

DATE                          object
QBPBSTASLNINDVOLNINDCARLN    float64
Average Loan Rate             object
dtype: object

In [ ]:
#Merge the dataframes
clean_df = pd.merge(revenue_rate_df, average_amount_financed_df, on="DATE")
clean_df.head()

         DATE  Total Loan Amount   Average Loan Rate Average Financed Amount
0  2014-07-01         379531.304  4.6800000000000000      26370.630000000000
1  2014-10-01         385156.262  4.8200000000000000      26755.300000000000
2  2015-01-01         389633.848  5.1900000000000000      27272.360000000000
3  2015-04-01         397633.220  5.3800000000000000      26932.270000000000
4  2015-07-01         407873.676  4.9200000000000000      27697.600000000000

In [ ]:
#Calculate average amount financed by and multiply by the average rate of that period = give us new total of revenue generated during that month
clean_df.dtypes

DATE                        object
Total Loan Amount          float64
Average Loan Rate           object
Average Financed Amount     object
dtype: object

In [ ]:
clean_df["Revenue Generated"] = clean_df["Average Amount Financed"] * clean_df["Average Loan Rate"]
clean_df.head()